-- phpMyAdmin SQL Dump
-- version 4.5.1
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2017-05-13 08:31:24
-- 服务器版本： 10.1.13-MariaDB
-- PHP Version: 5.6.23

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `univ_bridge`
--

-- --------------------------------------------------------

--
-- 表的结构 `forum_posts`
--

CREATE TABLE `forum_posts` (
  `id` int(11) NOT NULL,
  `title` varchar(32) NOT NULL,
  `author_id` int(11) NOT NULL,
  `content` varchar(1000) NOT NULL,
  `comment_num` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `last_comment_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `forum_posts`
--

INSERT INTO `forum_posts` (`id`, `title`, `author_id`, `content`, `comment_num`, `date`, `last_comment_time`) VALUES
(1, '清华大学', 1, '这里是清华大学的内容', 0, '2017-05-11 16:03:38', '2016-03-01 02:36:15'),
(2, '北京大学', 1, '这里是北京大学的内容', 0, '2017-05-11 16:03:38', '2017-05-13 03:18:22'),
(3, '复旦大学', 3, '这里是复旦大学的内容', 0, '2017-05-11 16:03:38', '2017-05-13 02:36:15');

-- --------------------------------------------------------

--
-- 表的结构 `post_comment`
--

CREATE TABLE `post_comment` (
  `id` int(11) NOT NULL,
  `post_id` int(11) NOT NULL,
  `comment_id` int(11) DEFAULT NULL,
  `author_id` int(11) NOT NULL,
  `content` varchar(1000) NOT NULL,
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `post_comment`
--

INSERT INTO `post_comment` (`id`, `post_id`, `comment_id`, `author_id`, `content`, `date`) VALUES
(1, 1, NULL, 1, 'hhhh', '2017-05-11 16:03:38'),
(2, 1, 1, 3, '66666666', '2017-05-11 16:03:38'),
(3, 1, NULL, 2, 'orz', '2017-05-11 16:03:38');

-- --------------------------------------------------------

--
-- 表的结构 `universities`
--

CREATE TABLE `universities` (
  `id` int(11) NOT NULL,
  `name` varchar(32) NOT NULL,
  `location` varchar(16) NOT NULL,
  `rank` int(4) NOT NULL,
  `scale` float NOT NULL,
  `url` varchar(32) NOT NULL,
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `universities`
--

INSERT INTO `universities` (`id`, `name`, `location`, `rank`, `scale`, `url`, `date`) VALUES
(1, '清华大学', '北京市', 1, 95.9, 'www.tsinghua.edu.cn/', '2017-05-11 16:03:38'),
(2, '北京大学', '北京市', 2, 82.6, 'www.pku.edu.cn/', '2017-05-11 16:03:38'),
(3, '浙江大学', '浙江省', 3, 80, 'www.zju.edu.cn/', '2017-05-11 16:03:38'),
(4, '上海交通大学', '上海市', 4, 78.7, 'www.sjtu.edu.cn/', '2017-05-11 16:03:38'),
(5, '复旦大学', '上海市', 5, 70.9, 'www.fudan.edu.cn/', '2017-05-11 16:03:38'),
(6, '南京大学', '江苏省', 6, 66.1, 'www.nju.edu.cn/', '2017-05-11 16:03:38'),
(7, '中国科学技术大学', '安徽省', 7, 65.5, 'www.ustc.edu.cn/', '2017-05-11 16:03:38'),
(8, '哈尔滨工业大学', '黑龙江省', 8, 63.5, 'www.hit.edu.cn/', '2017-05-11 16:03:38'),
(9, '华中科技大学', '湖北省', 9, 62.9, 'www.hust.edu.cn/', '2017-05-11 16:03:38'),
(10, '中山大学', '广东省', 10, 62.1, 'www.sysu.edu.cn/', '2017-05-11 16:03:38'),
(11, '东南大学', '江苏省', 11, 61.4, 'www.seu.edu.cn/', '2017-05-11 16:03:38'),
(12, '天津大学', '天津市', 12, 60.8, 'www.tju.edu.cn/', '2017-05-11 16:03:38'),
(13, '同济大学', '上海市', 13, 59.8, 'www.tongji.edu.cn/', '2017-05-11 16:03:38'),
(14, '北京航空航天大学', '北京市', 14, 59.6, 'www.buaa.edu.cn/', '2017-05-11 16:03:38'),
(15, '四川大学', '四川省', 15, 59.4, 'www.scu.edu.cn/', '2017-05-11 16:03:38'),
(16, '武汉大学', '湖北省', 16, 59.1, 'www.whu.edu.cn/', '2017-05-11 16:03:38'),
(17, '西安交通大学', '陕西省', 17, 58.9, 'www.xjtu.edu.cn/', '2017-05-11 16:03:38'),
(18, '南开大学', '天津市', 18, 58.3, 'www.nankai.edu.cn/', '2017-05-11 16:03:38'),
(19, '大连理工大学', '辽宁省', 19, 56.9, 'www.dlut.edu.cn/', '2017-05-11 16:03:38'),
(20, '山东大学', '山东省', 20, 56.3, 'www.sdu.edu.cn/', '2017-05-11 16:03:38'),
(21, '华南理工大学', '广东省', 21, 56.2, 'www.scut.edu.cn/', '2017-05-11 16:03:38'),
(22, '吉林大学', '吉林省', 22, 55.7, 'www.jlu.edu.cn/', '2017-05-11 16:03:38'),
(23, '厦门大学', '福建省', 23, 55.4, 'www.xmu.edu.cn/', '2017-05-11 16:03:38'),
(24, '北京师范大学', '北京市', 24, 54.6, 'www.bnu.edu.cn/', '2017-05-11 16:03:38'),
(25, '北京理工大学', '北京市', 25, 53.9, 'www.bit.edu.cn/', '2017-05-11 16:03:38'),
(26, '苏州大学', '江苏省', 26, 53.1, 'www.suda.edu.cn/', '2017-05-11 16:03:38'),
(27, '中南大学', '湖南省', 27, 52.5, 'www.csu.edu.cn/', '2017-05-11 16:03:38'),
(28, '北京科技大学', '北京市', 28, 52.2, 'www.ustb.edu.cn/', '2017-05-11 16:03:38'),
(29, '南京航空航天大学', '江苏省', 29, 52, 'www.nuaa.edu.cn/', '2017-05-11 16:03:38'),
(30, '华东理工大学', '上海市', 30, 51.9, 'www.ecust.edu.cn/', '2017-05-11 16:03:38'),
(31, '湖南大学', '湖南省', 31, 51.4, 'www.hnu.edu.cn/', '2017-05-11 16:03:38'),
(32, '中国人民大学', '北京市', 31, 51.4, 'www.ruc.edu.cn/', '2017-05-11 16:03:38'),
(33, '重庆大学', '重庆市', 33, 50.9, 'www.cqu.edu.cn/', '2017-05-11 16:03:38'),
(34, '华东师范大学', '上海市', 34, 50.6, 'www.ecnu.edu.cn/', '2017-05-11 16:03:38'),
(35, '中国地质大学（武汉）', '湖北省', 35, 50.4, 'www.cug.edu.cn/', '2017-05-11 16:03:38'),
(36, '西北工业大学', '陕西省', 36, 50.3, 'www.nwpu.edu.cn/', '2017-05-11 16:03:38'),
(37, '电子科技大学', '四川省', 36, 50.3, 'www.uestc.edu.cn/', '2017-05-11 16:03:38'),
(38, '中国农业大学', '北京市', 38, 48.9, 'www.cau.edu.cn/', '2017-05-11 16:03:38'),
(39, '中国石油大学（北京）', '北京市', 38, 48.9, 'www.cup.edu.cn/', '2017-05-11 16:03:38'),
(40, '北京化工大学', '北京市', 40, 48.6, 'www.buct.edu.cn/', '2017-05-11 16:03:38'),
(41, '北京交通大学', '北京市', 40, 48.6, 'www.njtu.edu.cn/', '2017-05-11 16:03:38'),
(42, '南京理工大学', '江苏省', 42, 48.5, 'www.njust.edu.cn/', '2017-05-11 16:03:38'),
(43, '华北电力大学（北京）', '北京市', 43, 48.2, 'www.ncepu.edu.cn/', '2017-05-11 16:03:38'),
(44, '北京邮电大学', '北京市', 44, 48.1, 'www.bupt.edu.cn/', '2017-05-11 16:03:38'),
(45, '西安电子科技大学', '陕西省', 45, 47.6, 'www.xidian.edu.cn/', '2017-05-11 16:03:38'),
(46, '武汉理工大学', '湖北省', 46, 47.4, 'www.whut.edu.cn/', '2017-05-11 16:03:38'),
(47, '上海大学', '上海市', 46, 47.4, 'www.shu.edu.cn/', '2017-05-11 16:03:38'),
(48, '华中师范大学', '湖北省', 48, 47.3, 'www.ccnu.edu.cn/', '2017-05-11 16:03:38'),
(49, '东北大学', '辽宁省', 48, 47.3, 'www.neu.edu.cn/', '2017-05-11 16:03:38'),
(50, '东北师范大学', '吉林省', 50, 47.1, 'www.nenu.edu.cn/', '2017-05-11 16:03:38'),
(51, '东华大学', '上海市', 51, 47, 'www.dhu.edu.cn/', '2017-05-11 16:03:38'),
(52, '福州大学', '福建省', 52, 46.7, 'www.fzu.edu.cn/', '2017-05-11 16:03:38'),
(53, '首都医科大学', '北京市', 53, 46.5, 'www.ccmu.edu.cn/', '2017-05-11 16:03:38'),
(54, '兰州大学', '甘肃省', 53, 46.5, 'www.lzu.edu.cn/', '2017-05-11 16:03:38'),
(55, '江南大学', '江苏省', 55, 46.3, 'www.jiangnan.edu.cn/', '2017-05-11 16:03:38'),
(56, '合肥工业大学', '安徽省', 56, 45.6, 'www.hfut.edu.cn/', '2017-05-11 16:03:38'),
(57, '南京医科大学', '江苏省', 57, 45.5, 'www.njmu.edu.cn/', '2017-05-11 16:03:38'),
(58, '中国海洋大学', '山东省', 58, 45.3, 'www.ouc.edu.cn/', '2017-05-11 16:03:38'),
(59, '中国矿业大学', '江苏省', 59, 45.2, 'www.cumt.edu.cn/', '2017-05-11 16:03:38'),
(60, '暨南大学', '广东省', 60, 44.6, 'www.jnu.edu.cn/', '2017-05-11 16:03:38'),
(61, '西南大学', '重庆市', 61, 44.4, 'www.swu.edu.cn/', '2017-05-11 16:03:38'),
(62, '南京农业大学', '江苏省', 62, 44.3, 'www.njau.edu.cn/', '2017-05-11 16:03:38'),
(63, '河海大学', '江苏省', 62, 44.3, 'www.hhu.edu.cn/', '2017-05-11 16:03:38'),
(64, '哈尔滨工程大学', '黑龙江省', 64, 44.2, 'www.hrbeu.edu.cn/', '2017-05-11 16:03:38'),
(65, '华中农业大学', '湖北省', 65, 44, 'www.hzau.edu.cn/', '2017-05-11 16:03:38'),
(66, '中国药科大学', '江苏省', 66, 43.7, 'www.cpu.edu.cn/', '2017-05-11 16:03:38'),
(67, '西南交通大学', '四川省', 67, 43.6, 'www.swjtu.edu.cn/', '2017-05-11 16:03:38'),
(68, '天津医科大学', '天津市', 68, 43.3, 'www.tijmu.edu.cn/', '2017-05-11 16:03:38'),
(69, '西北农林科技大学', '陕西省', 69, 42.8, 'www.nwsuaf.edu.cn/', '2017-05-11 16:03:38'),
(70, '南京师范大学', '江苏省', 69, 42.8, 'www.njnu.edu.cn/', '2017-05-11 16:03:38'),
(71, '西北大学', '陕西省', 71, 42.5, 'www.nwu.edu.cn/', '2017-05-11 16:03:38'),
(72, '江苏大学', '江苏省', 72, 42.3, 'www.ujs.edu.cn/', '2017-05-11 16:03:38'),
(73, '浙江工业大学', '浙江省', 73, 42.1, 'www.zjut.edu.cn/', '2017-05-11 16:03:38'),
(74, '北京林业大学', '北京市', 74, 42, 'www.bjfu.edu.cn/', '2017-05-11 16:03:38'),
(75, '南京邮电大学', '江苏省', 75, 41.9, 'www.njupt.edu.cn/', '2017-05-11 16:03:38'),
(76, '南方医科大学', '广东省', 75, 41.9, 'www.fimmu.com/', '2017-05-11 16:03:38'),
(77, '陕西师范大学', '陕西省', 75, 41.9, 'www.snnu.edu.cn/', '2017-05-11 16:03:38'),
(78, '南京工业大学', '江苏省', 75, 41.9, 'www.njtech.edu.cn/', '2017-05-11 16:03:38'),
(79, '北京工业大学', '北京市', 79, 41.8, 'www.bjut.edu.cn/', '2017-05-11 16:03:38'),
(80, '燕山大学', '河北省', 80, 41.5, 'www.ysu.edu.cn/', '2017-05-11 16:03:38'),
(81, '华南师范大学', '广东省', 81, 41.4, 'www.scnu.edu.cn/', '2017-05-11 16:03:38'),
(82, '河北工业大学', '河北省', 82, 41.1, 'www.hebut.edu.cn/', '2017-05-11 16:03:38'),
(83, '北京中医药大学', '北京市', 83, 41, 'www.bucm.edu.cn/', '2017-05-11 16:03:38'),
(84, '浙江师范大学', '浙江省', 83, 41, 'www.zjnu.edu.cn/', '2017-05-11 16:03:38'),
(85, '汕头大学', '广东省', 83, 41, 'www.stu.edu.cn/', '2017-05-11 16:03:38'),
(86, '长安大学', '陕西省', 86, 40.9, 'www.chd.edu.cn/', '2017-05-11 16:03:38'),
(87, '沈阳药科大学', '辽宁省', 87, 40.8, 'www.syphu.edu.cn/', '2017-05-11 16:03:38'),
(88, '湘潭大学', '湖南省', 87, 40.8, 'www.xtu.edu.cn/', '2017-05-11 16:03:38'),
(89, '大连海事大学', '辽宁省', 89, 40.6, 'www.dlmu.edu.cn/', '2017-05-11 16:03:38'),
(90, '浙江理工大学', '浙江省', 90, 40.5, 'www.zstu.edu.cn/', '2017-05-11 16:03:38'),
(91, '杭州师范大学', '浙江省', 91, 40.4, 'www.hznu.edu.cn/', '2017-05-11 16:03:38'),
(92, '大连医科大学', '辽宁省', 91, 40.4, 'www.dlmedu.edu.cn/', '2017-05-11 16:03:38'),
(93, '河北大学', '河北省', 93, 40.3, 'www.hbu.edu.cn/', '2017-05-11 16:03:38'),
(94, '杭州电子科技大学', '浙江省', 94, 40.2, 'www.hdu.edu.cn/', '2017-05-11 16:03:38'),
(95, '中央民族大学', '北京市', 94, 40.2, 'www.muc.edu.cn/', '2017-05-11 16:03:38'),
(96, '安徽大学', '安徽省', 96, 40, 'www.ahu.edu.cn/', '2017-05-11 16:03:38'),
(97, '山西大学', '山西省', 97, 39.4, 'www.sxu.edu.cn/', '2017-05-11 16:03:38'),
(98, '宁波大学', '浙江省', 97, 39.4, 'www.nbu.edu.cn/', '2017-05-11 16:03:38'),
(99, '石家庄铁道大学', '河北省', 97, 39.4, 'www.stdu.edu.cn/', '2017-05-11 16:03:38'),
(100, '扬州大学', '江苏省', 100, 39.3, 'www.yzu.edu.cn/', '2017-05-11 16:03:38'),
(101, '湖北大学', '湖北省', 101, 39.2, 'www.hubu.edu.cn/', '2017-05-11 16:03:38'),
(102, '温州医科大学', '浙江省', 102, 39, 'www.wmu.edu.cn/', '2017-05-11 16:03:38'),
(103, '河北医科大学', '河北省', 102, 39, 'www.hebmu.edu.cn/', '2017-05-11 16:03:38'),
(104, '南京信息工程大学', '江苏省', 104, 38.8, 'www.nuist.edu.cn/', '2017-05-11 16:03:38'),
(105, '深圳大学', '广东省', 104, 38.8, 'www.szu.edu.cn/', '2017-05-11 16:03:38'),
(106, '首都师范大学', '北京市', 104, 38.8, 'www.cnu.edu.cn/', '2017-05-11 16:03:38'),
(107, '上海理工大学', '上海市', 107, 38.7, 'www.usst.edu.cn/', '2017-05-11 16:03:38'),
(108, '太原理工大学', '山西省', 108, 38.6, 'www.tyut.edu.cn/', '2017-05-11 16:03:38'),
(109, '浙江工商大学', '浙江省', 108, 38.6, 'www.hzic.edu.cn/', '2017-05-11 16:03:38'),
(110, '华侨大学', '福建省', 110, 38.5, 'www.hqu.edu.cn/', '2017-05-11 16:03:38'),
(111, '湖南师范大学', '湖南省', 110, 38.5, 'www.hunnu.edu.cn/', '2017-05-11 16:03:38'),
(112, '广西大学', '广西壮族自治区', 112, 38.3, 'www.gxu.edu.cn/', '2017-05-11 16:03:38'),
(113, '上海师范大学', '上海市', 112, 38.3, 'www.shnu.edu.cn/', '2017-05-11 16:03:38'),
(114, '上海中医药大学', '上海市', 114, 38, 'www.shutcm.edu.cn/', '2017-05-11 16:03:38'),
(115, '东北林业大学', '黑龙江省', 114, 38, 'www.nefu.edu.cn/', '2017-05-11 16:03:38'),
(116, '武汉科技大学', '湖北省', 114, 38, 'www.wust.edu.cn/', '2017-05-11 16:03:38'),
(117, '东北农业大学', '黑龙江省', 114, 38, 'www.neau.edu.cn/', '2017-05-11 16:03:38'),
(118, '华南农业大学', '广东省', 118, 37.9, 'www.scau.edu.cn/', '2017-05-11 16:03:38'),
(119, '辽宁大学', '辽宁省', 118, 37.9, 'www.lnu.edu.cn/', '2017-05-11 16:03:38'),
(120, '青岛大学', '山东省', 120, 37.8, 'www.qdu.edu.cn/', '2017-05-11 16:03:38'),
(121, '长沙理工大学', '湖南省', 120, 37.8, 'www.csust.edu.cn/', '2017-05-11 16:03:38'),
(122, '福建医科大学', '福建省', 120, 37.8, 'www.fjmu.edu.cn/', '2017-05-11 16:03:38'),
(123, '河北科技大学', '河北省', 123, 37.7, 'www.hebust.edu.cn/', '2017-05-11 16:03:38'),
(124, '河北农业大学', '河北省', 124, 37.6, 'www.hebau.edu.cn/', '2017-05-11 16:03:38'),
(125, '西安建筑科技大学', '陕西省', 124, 37.6, 'www.xauat.edu.cn/zh-cn/', '2017-05-11 16:03:38'),
(126, '重庆医科大学', '重庆市', 124, 37.6, 'www.cqmu.edu.cn/', '2017-05-11 16:03:38'),
(127, '广州医科大学', '广东省', 127, 37.5, 'new.gzhmu.edu.cn/', '2017-05-11 16:03:38'),
(128, '河北师范大学', '河北省', 127, 37.5, 'www.hebtu.edu.cn/', '2017-05-11 16:03:38'),
(129, '广东工业大学', '广东省', 129, 37.4, 'www.gdut.edu.cn/', '2017-05-11 16:03:38'),
(130, '上海海事大学', '上海市', 129, 37.4, 'www.shmtu.edu.cn/', '2017-05-11 16:03:38'),
(131, '南昌大学', '江西省', 131, 37.3, 'www.ncu.edu.cn/', '2017-05-11 16:03:38'),
(132, '渤海大学', '辽宁省', 132, 37.2, 'www.bhu.edu.cn/', '2017-05-11 16:03:38'),
(133, '青岛科技大学', '山东省', 133, 37, 'www.qust.edu.cn/', '2017-05-11 16:03:38'),
(134, '西安理工大学', '陕西省', 134, 36.8, 'www.xaut.edu.cn/', '2017-05-11 16:03:38'),
(135, '东北石油大学', '黑龙江省', 135, 36.7, 'www.dqpi.edu.cn/', '2017-05-11 16:03:38'),
(136, '安徽医科大学', '安徽省', 135, 36.7, 'www.ahmu.edu.cn/', '2017-05-11 16:03:38'),
(137, '黑龙江中医药大学', '黑龙江省', 135, 36.7, 'www.hljucm.net/', '2017-05-11 16:03:38'),
(138, '沈阳航空航天大学', '辽宁省', 138, 36.6, 'www.sau.edu.cn/', '2017-05-11 16:03:38'),
(139, '山东财经大学', '山东省', 139, 36.5, 'www.sdufe.edu.cn/', '2017-05-11 16:03:38'),
(140, '江苏师范大学', '江苏省', 140, 36.4, 'www.xznu.edu.cn/', '2017-05-11 16:03:38'),
(141, '三峡大学', '湖北省', 140, 36.4, 'www.ctgu.edu.cn/', '2017-05-11 16:03:38'),
(142, '黑龙江大学', '黑龙江省', 142, 36.3, 'www.hlju.edu.cn/', '2017-05-11 16:03:38'),
(143, '天津师范大学', '天津市', 142, 36.3, 'www.tjnu.edu.cn/', '2017-05-11 16:03:38'),
(144, '长春理工大学', '吉林省', 144, 36, 'www.cust.edu.cn/', '2017-05-11 16:03:38'),
(145, '北京工商大学', '北京市', 144, 36, 'www.btbu.edu.cn/', '2017-05-11 16:03:38'),
(146, '武汉工程大学', '湖北省', 146, 35.9, 'www.wit.edu.cn/', '2017-05-11 16:03:38'),
(147, '天津工业大学', '天津市', 146, 35.9, 'www.tjpu.edu.cn/', '2017-05-11 16:03:38'),
(148, '中国计量学院', '浙江省', 146, 35.9, 'www.cjlu.edu.cn/', '2017-05-11 16:03:38'),
(149, '福建师范大学', '福建省', 149, 35.8, 'www.fjnu.edu.cn/', '2017-05-11 16:03:38'),
(150, '安徽师范大学', '安徽省', 149, 35.8, 'www.ahnu.edu.cn/', '2017-05-11 16:03:38'),
(151, '温州大学', '浙江省', 149, 35.8, 'www.wzu.edu.cn/', '2017-05-11 16:03:38'),
(152, '山西师范大学', '山西省', 149, 35.8, 'www.sxnu.edu.cn/', '2017-05-11 16:03:38'),
(153, '西南石油大学', '四川省', 153, 35.7, 'www.swpu.edu.cn/', '2017-05-11 16:03:38'),
(154, '济南大学', '山东省', 154, 35.6, 'www.ujn.edu.cn/', '2017-05-11 16:03:38'),
(155, '山东师范大学', '山东省', 154, 35.6, 'www.sdnu.edu.cn/', '2017-05-11 16:03:38'),
(156, '江苏科技大学', '江苏省', 156, 35.5, 'www.just.edu.cn/', '2017-05-11 16:03:38'),
(157, '郑州大学', '河南省', 156, 35.5, 'www.zzu.edu.cn/', '2017-05-11 16:03:38'),
(158, '浙江中医药大学', '浙江省', 156, 35.5, 'www.zcmu.edu.cn/', '2017-05-11 16:03:38'),
(159, '广州大学', '广东省', 159, 35.4, 'www.gzhu.edu.cn/', '2017-05-11 16:03:38'),
(160, '河南大学', '河南省', 160, 35.3, 'www.henu.edu.cn/', '2017-05-11 16:03:38'),
(161, '重庆邮电大学', '重庆市', 161, 35.2, 'www.cqupt.edu.cn/', '2017-05-11 16:03:38'),
(162, '辽宁工业大学', '辽宁省', 161, 35.2, 'www.lnit.edu.cn/', '2017-05-11 16:03:38'),
(163, '安徽工业大学', '安徽省', 163, 35.1, 'www.ahut.edu.cn/', '2017-05-11 16:03:38'),
(164, '中国民航大学', '天津市', 163, 35.1, 'www.cauc.edu.cn/', '2017-05-11 16:03:38'),
(165, '辽宁师范大学', '辽宁省', 163, 35.1, 'www.lnnu.edu.cn/', '2017-05-11 16:03:38'),
(166, '中南民族大学', '湖北省', 166, 35, 'www.scuec.edu.cn/', '2017-05-11 16:03:38'),
(167, '上海海洋大学', '上海市', 167, 34.9, 'www.shou.edu.cn/', '2017-05-11 16:03:38'),
(168, '四川农业大学', '四川省', 167, 34.9, 'www.sicau.edu.cn/', '2017-05-11 16:03:38'),
(169, '沈阳建筑大学', '辽宁省', 169, 34.7, 'www.sjzu.edu.cn/', '2017-05-11 16:03:38'),
(170, '广西师范大学', '广西壮族自治区', 169, 34.7, 'www.gxnu.edu.cn/', '2017-05-11 16:03:38'),
(171, '河南理工大学', '河南省', 169, 34.7, 'www.hpu.edu.cn/', '2017-05-11 16:03:38'),
(172, '西北师范大学', '甘肃省', 169, 34.7, 'www.nwnu.edu.cn/', '2017-05-11 16:03:38'),
(173, '集美大学', '福建省', 169, 34.7, 'www.jmu.edu.cn/', '2017-05-11 16:03:38'),
(174, '天津科技大学', '天津市', 174, 34.6, 'www.tuli.edu.cn/', '2017-05-11 16:03:38'),
(175, '南京中医药大学', '江苏省', 175, 34.5, 'www.njutcm.edu.cn/', '2017-05-11 16:03:38'),
(176, '湖南农业大学', '湖南省', 175, 34.5, 'www.hunau.edu.cn/', '2017-05-11 16:03:38'),
(177, '成都理工大学', '四川省', 175, 34.5, 'www.cdut.edu.cn/', '2017-05-11 16:03:38'),
(178, '北方工业大学', '北京市', 175, 34.5, 'www.ncut.edu.cn/', '2017-05-11 16:03:38'),
(179, '海南大学', '海南省', 175, 34.5, 'www.hainu.edu.cn/', '2017-05-11 16:03:38'),
(180, '南通大学', '江苏省', 180, 34.4, 'www.ntu.edu.cn/', '2017-05-11 16:03:38'),
(181, '贵州大学', '贵州省', 180, 34.4, 'www.gzu.edu.cn/', '2017-05-11 16:03:38'),
(182, '浙江农林大学', '浙江省', 180, 34.4, 'www.zjfc.edu.cn/', '2017-05-11 16:03:38'),
(183, '云南师范大学', '云南省', 180, 34.4, 'www.ynnu.edu.cn/', '2017-05-11 16:03:38'),
(184, '常州大学', '江苏省', 184, 34.3, 'www.cczu.edu.cn/', '2017-05-11 16:03:38'),
(185, '北京建筑大学', '北京市', 184, 34.3, 'www.bucea.edu.cn/', '2017-05-11 16:03:38'),
(186, '西安邮电大学', '陕西省', 184, 34.3, 'www.xiyou.edu.cn/', '2017-05-11 16:03:38'),
(187, '宁夏大学', '宁夏自治区', 184, 34.3, 'www.nxu.edu.cn/', '2017-05-11 16:03:38'),
(188, '福建中医药大学', '福建省', 184, 34.3, 'www.fjtcm.edu.cn/', '2017-05-11 16:03:38'),
(189, '中北大学', '山西省', 189, 34.2, 'www.nuc.edu.cn/', '2017-05-11 16:03:38'),
(190, '兰州交通大学', '甘肃省', 189, 34.2, 'www.lzjtu.edu.cn/', '2017-05-11 16:03:38'),
(191, '内蒙古大学', '内蒙古自治区', 191, 34.1, 'www.imu.edu.cn/', '2017-05-11 16:03:38'),
(192, '南华大学', '湖南省', 191, 34.1, 'www.usc.edu.cn/', '2017-05-11 16:03:38'),
(193, '河南师范大学', '河南省', 191, 34.1, 'www.henannu.edu.cn/', '2017-05-11 16:03:38'),
(194, '苏州科技学院', '江苏省', 191, 34.1, 'www.usts.edu.cn/', '2017-05-11 16:03:38'),
(195, '大连交通大学', '辽宁省', 191, 34.1, 'www.djtu.edu.cn/', '2017-05-11 16:03:38'),
(196, '福建农林大学', '福建省', 196, 34, 'www.fafu.edu.cn/', '2017-05-11 16:03:38'),
(197, '陕西科技大学', '陕西省', 197, 33.9, 'www.sust.edu.cn/', '2017-05-11 16:03:38'),
(198, '沈阳农业大学', '辽宁省', 197, 33.9, 'www.syau.edu.cn/', '2017-05-11 16:03:38'),
(199, '山东科技大学', '山东省', 197, 33.9, 'www.sdust.edu.cn/', '2017-05-11 16:03:38'),
(200, '兰州理工大学', '甘肃省', 200, 33.8, 'www.gsut.edu.cn/', '2017-05-11 16:03:38'),
(201, '太原科技大学', '山西省', 200, 33.8, 'www.tyust.edu.cn/', '2017-05-11 16:03:38'),
(202, '长江大学', '湖北省', 202, 33.7, 'www.yangtzeu.edu.cn/', '2017-05-11 16:03:38'),
(203, '徐州医学院', '江苏省', 202, 33.7, 'www.xzmc.edu.cn/', '2017-05-11 16:03:38'),
(204, '重庆工商大学', '重庆市', 204, 33.6, 'www.ctbu.edu.cn/', '2017-05-11 16:03:38'),
(205, '江西师范大学', '江西省', 205, 33.5, 'www.jxnu.edu.cn/', '2017-05-11 16:03:38'),
(206, '青岛理工大学', '山东省', 205, 33.5, 'www.qtech.edu.cn/', '2017-05-11 16:03:38'),
(207, '山东农业大学', '山东省', 207, 33.4, 'www.sdau.edu.cn/', '2017-05-11 16:03:38'),
(208, '绍兴文理学院', '浙江省', 207, 33.4, 'www.usx.edu.cn/', '2017-05-11 16:03:38'),
(209, '武汉轻工大学', '湖北省', 209, 33.3, 'www.whpu.edu.cn/', '2017-05-11 16:03:38'),
(210, '辽宁工程技术大学', '辽宁省', 210, 33.2, 'www.lntu.edu.cn/', '2017-05-11 16:03:38'),
(211, '哈尔滨理工大学', '黑龙江省', 210, 33.2, 'www.hrbust.edu.cn/', '2017-05-11 16:03:38'),
(212, '湖南科技大学', '湖南省', 212, 33, 'www.hnust.edu.cn/', '2017-05-11 16:03:38'),
(213, '沈阳工业大学', '辽宁省', 212, 33, 'www.sut.edu.cn/', '2017-05-11 16:03:38'),
(214, '桂林理工大学', '广西壮族自治区', 212, 33, 'www.glut.edu.cn/', '2017-05-11 16:03:38'),
(215, '河北工程大学', '河北省', 212, 33, 'www.hebeu.edu.cn/', '2017-05-11 16:03:38'),
(216, '延边大学', '吉林省', 212, 33, 'www.ybu.edu.cn/', '2017-05-11 16:03:38'),
(217, '烟台大学', '山东省', 217, 32.8, 'www.ytu.edu.cn/', '2017-05-11 16:03:38'),
(218, '昆明理工大学', '云南省', 217, 32.8, 'www.kmust.edu.cn/', '2017-05-11 16:03:38'),
(219, '中南林业科技大学', '湖南省', 217, 32.8, 'www.csuft.edu.cn/', '2017-05-11 16:03:38'),
(220, '山西医科大学', '山西省', 220, 32.7, 'www.sxmu.edu.cn/', '2017-05-11 16:03:38'),
(221, '广东医学院', '广东省', 220, 32.7, 'www.gdmc.edu.cn/', '2017-05-11 16:03:38'),
(222, '西安石油大学', '陕西省', 222, 32.6, 'www.xapi.edu.cn/', '2017-05-11 16:03:38'),
(223, '北京信息科技大学', '北京市', 222, 32.6, 'www.bistu.edu.cn/', '2017-05-11 16:03:38'),
(224, '四川医科大学', '四川省', 222, 32.6, 'www.scmu.edu.cn/', '2017-05-11 16:03:38'),
(225, '山西大同大学', '山西省', 222, 32.6, 'www.sxdtdx.edu.cn/', '2017-05-11 16:03:38'),
(226, '广西民族大学', '广西壮族自治区', 222, 32.6, 'www.gxun.edu.cn/', '2017-05-11 16:03:38'),
(227, '河南工业大学', '河南省', 227, 32.4, 'www.haut.edu.cn/', '2017-05-11 16:03:38'),
(228, '河南科技大学', '河南省', 228, 32.3, 'www.haust.edu.cn/', '2017-05-11 16:03:38'),
(229, '桂林电子科技大学', '广西壮族自治区', 228, 32.3, 'www.gliet.edu.cn/', '2017-05-11 16:03:38'),
(230, '上海电力学院', '上海市', 228, 32.3, 'www.shiep.edu.cn/', '2017-05-11 16:03:38'),
(231, '南京林业大学', '江苏省', 231, 32.2, 'www.njfu.edu.cn/', '2017-05-11 16:03:38'),
(232, '嘉兴学院', '浙江省', 231, 32.2, 'www.zjxu.edu.cn/', '2017-05-11 16:03:38'),
(233, '大连民族大学', '辽宁省', 231, 32.2, 'www.dlnu.edu.cn/', '2017-05-11 16:03:38'),
(234, '淮阴师范学院', '江苏省', 231, 32.2, 'www.hytc.edu.cn/', '2017-05-11 16:03:38'),
(235, '哈尔滨师范大学', '黑龙江省', 231, 32.2, 'www.hrbnu.edu.cn/', '2017-05-11 16:03:38'),
(236, '大连大学', '辽宁省', 236, 32.1, 'www.dlu.edu.cn/', '2017-05-11 16:03:38'),
(237, '浙江海洋学院', '浙江省', 236, 32.1, 'www.zjou.edu.cn/', '2017-05-11 16:03:38'),
(238, '曲阜师范大学', '山东省', 238, 32, 'www.qfnu.edu.cn/', '2017-05-11 16:03:38'),
(239, '大连海洋大学', '辽宁省', 238, 32, 'www.dlou.edu.cn/', '2017-05-11 16:03:38'),
(240, '常熟理工学院', '江苏省', 238, 32, 'www.cslg.cn/', '2017-05-11 16:03:38'),
(241, '四川师范大学', '四川省', 241, 31.9, 'www.sicnu.edu.cn/', '2017-05-11 16:03:38'),
(242, '湖南工业大学', '湖南省', 242, 31.8, 'www.hut.edu.cn/', '2017-05-11 16:03:38'),
(243, '石河子大学', '新疆自治区', 242, 31.8, 'www.shzu.edu.cn/', '2017-05-11 16:03:38'),
(244, '大连工业大学', '辽宁省', 244, 31.7, 'www.dlpu.edu.cn/', '2017-05-11 16:03:38'),
(245, '长春工业大学', '吉林省', 245, 31.6, 'www.ccut.edu.cn/', '2017-05-11 16:03:38'),
(246, '西南民族大学', '四川省', 245, 31.6, 'www.swun.edu.cn/', '2017-05-11 16:03:38'),
(247, '辽宁石油化工大学', '辽宁省', 247, 31.4, 'www.lnpu.edu.cn/', '2017-05-11 16:03:38'),
(248, '宁波工程学院', '浙江省', 247, 31.4, 'www.nbut.cn/', '2017-05-11 16:03:38'),
(249, '成都中医药大学', '四川省', 249, 31.3, 'www.cdutcm.edu.cn/', '2017-05-11 16:03:38'),
(250, '南昌航空大学', '江西省', 250, 31.2, 'www.nchu.edu.cn/', '2017-05-11 16:03:38'),
(251, '上海应用技术学院', '上海市', 250, 31.2, 'www.sit.edu.cn/', '2017-05-11 16:03:38'),
(252, '吉林师范大学', '吉林省', 250, 31.2, 'www.jlnu.edu.cn/', '2017-05-11 16:03:38'),
(253, '西安工程大学', '陕西省', 253, 31.1, 'www.xpu.edu.cn/', '2017-05-11 16:03:38'),
(254, '山西农业大学', '山西省', 254, 30.9, 'www.sxau.edu.cn/', '2017-05-11 16:03:38'),
(255, '沈阳理工大学', '辽宁省', 254, 30.9, 'www.sylu.edu.cn/', '2017-05-11 16:03:38'),
(256, '河南农业大学', '河南省', 256, 30.8, 'www.henau.edu.cn/', '2017-05-11 16:03:38'),
(257, '安徽农业大学', '安徽省', 256, 30.8, 'www.ahau.edu.cn/', '2017-05-11 16:03:38'),
(258, '广东药学院', '广东省', 256, 30.8, 'www.gdpu.edu.cn/', '2017-05-11 16:03:38'),
(259, '辽宁医学院', '辽宁省', 256, 30.8, 'www.jzmu.edu.cn/', '2017-05-11 16:03:38'),
(260, '盐城工学院', '江苏省', 260, 30.7, 'www.ycit.cn/', '2017-05-11 16:03:38'),
(261, '华东交通大学', '江西省', 261, 30.6, 'www.ecjtu.jx.cn/', '2017-05-11 16:03:38'),
(262, '重庆师范大学', '重庆市', 261, 30.6, 'www.cqnu.edu.cn/', '2017-05-11 16:03:38'),
(263, '山东建筑大学', '山东省', 261, 30.6, 'www.sdjzu.edu.cn/', '2017-05-11 16:03:38'),
(264, '长春大学', '吉林省', 261, 30.6, 'www.ccu.edu.cn/', '2017-05-11 16:03:38'),
(265, '山东理工大学', '山东省', 265, 30.3, 'www.sdut.edu.cn/', '2017-05-11 16:03:38'),
(266, '西南科技大学', '四川省', 265, 30.3, 'www.swust.edu.cn/', '2017-05-11 16:03:38'),
(267, '安徽理工大学', '安徽省', 265, 30.3, 'www.aust.edu.cn/', '2017-05-11 16:03:38'),
(268, '沈阳大学', '辽宁省', 265, 30.3, 'www.syu.edu.cn/', '2017-05-11 16:03:38'),
(269, '西华师范大学', '四川省', 269, 30.2, 'www.cwnu.edu.cn/', '2017-05-11 16:03:38'),
(270, '山东中医药大学', '山东省', 269, 30.2, 'www.sdutcm.edu.cn/', '2017-05-11 16:03:38'),
(271, '广东海洋大学', '广东省', 271, 30.1, 'www.gdou.edu.cn/', '2017-05-11 16:03:38'),
(272, '内蒙古工业大学', '内蒙古自治区', 272, 29.8, 'www.imut.edu.cn/', '2017-05-11 16:03:38'),
(273, '洛阳师范学院', '河南省', 272, 29.8, 'www.lynu.cn/', '2017-05-11 16:03:38'),
(274, '西华大学', '四川省', 274, 29.6, 'www.xhu.edu.cn/', '2017-05-11 16:03:38'),
(275, '五邑大学', '广东省', 274, 29.6, 'www.wyu.edu.cn/', '2017-05-11 16:03:38'),
(276, '甘肃农业大学', '甘肃省', 274, 29.6, 'www.gsau.edu.cn/', '2017-05-11 16:03:38'),
(277, '江西理工大学', '江西省', 277, 29.5, 'www.jxust.cn/', '2017-05-11 16:03:38'),
(278, '云南农业大学', '云南省', 277, 29.5, 'www.ynau.edu.cn/', '2017-05-11 16:03:38'),
(279, '吉林农业大学', '吉林省', 277, 29.5, 'www.jlau.edu.cn/', '2017-05-11 16:03:38'),
(280, '淮海工学院', '江苏省', 280, 29.3, 'www.hhit.edu.cn/', '2017-05-11 16:03:38'),
(281, '鲁东大学', '山东省', 281, 29.2, 'www.ldu.edu.cn/', '2017-05-11 16:03:38'),
(282, '河南科技学院', '河南省', 282, 29.1, 'www.hist.edu.cn/', '2017-05-11 16:03:38'),
(283, '贵州医科大学', '贵州省', 282, 29.1, 'www.gmc.edu.cn/', '2017-05-11 16:03:38'),
(284, '齐齐哈尔大学', '黑龙江省', 282, 29.1, 'www.qqhru.edu.cn/', '2017-05-11 16:03:38'),
(285, '北华大学', '吉林省', 282, 29.1, 'www.beihua.edu.cn/', '2017-05-11 16:03:38'),
(286, '淮北师范大学', '安徽省', 286, 29, 'www.hbcnc.edu.cn/', '2017-05-11 16:03:38'),
(287, '成都信息工程大学', '四川省', 287, 28.9, 'www.cuit.edu.cn/', '2017-05-11 16:03:38'),
(288, '青岛农业大学', '山东省', 288, 28.8, 'www.qau.edu.cn/', '2017-05-11 16:03:38'),
(289, '潍坊医学院', '山东省', 288, 28.8, 'www.wfmc.edu.cn/', '2017-05-11 16:03:38'),
(290, '新疆大学', '新疆自治区', 290, 28.6, 'www.xju.edu.cn/', '2017-05-11 16:03:38'),
(291, '齐鲁工业大学', '山东省', 290, 28.6, 'www.sdili.edu.cn/', '2017-05-11 16:03:38'),
(292, '淮阴工学院', '江苏省', 292, 28.5, 'www.hyit.edu.cn/', '2017-05-11 16:03:38'),
(293, '北京联合大学', '北京市', 293, 28.4, 'www.buu.edu.cn/', '2017-05-11 16:03:38'),
(294, '聊城大学', '山东省', 293, 28.4, 'www.lcu.edu.cn/', '2017-05-11 16:03:38'),
(295, '临沂大学', '山东省', 295, 28.3, 'www.lyu.edu.cn/', '2017-05-11 16:03:38'),
(296, '蚌埠医学院', '安徽省', 295, 28.3, 'www.bbmc.edu.cn/', '2017-05-11 16:03:38'),
(297, '黑龙江八一农垦大学', '黑龙江省', 297, 28, 'www.hlau.cn/', '2017-05-11 16:03:38'),
(298, '江西农业大学', '江西省', 298, 27.9, 'www.jxau.edu.cn/', '2017-05-11 16:03:38'),
(299, '中原工学院', '河南省', 299, 27.7, 'www.zzti.edu.cn/', '2017-05-11 16:03:38'),
(300, '北京石油化工学院', '北京市', 299, 27.7, 'www.bipt.edu.cn/', '2017-05-11 16:03:38'),
(301, '重庆科技学院', '重庆市', 301, 27.6, 'www.cqust.edu.cn/', '2017-05-11 16:03:38'),
(302, '内蒙古科技大学', '内蒙古自治区', 301, 27.6, 'www.imust.cn/', '2017-05-11 16:03:38'),
(303, '西南林业大学', '云南省', 303, 27.5, 'www.swfc.edu.cn/', '2017-05-11 16:03:38'),
(304, '贵州师范大学', '贵州省', 303, 27.5, 'www.gznu.edu.cn/', '2017-05-11 16:03:38'),
(305, '四川理工学院', '四川省', 305, 27.2, 'www.suse.edu.cn/', '2017-05-11 16:03:38'),
(306, '新疆医科大学', '新疆自治区', 305, 27.2, 'www.xjmu.edu.cn/', '2017-05-11 16:03:38'),
(307, '江西中医药大学', '江西省', 307, 26.4, 'www.jxutcm.edu.cn/', '2017-05-11 16:03:38'),
(308, '景德镇陶瓷学院', '江西省', 308, 26.1, 'www.jci.edu.cn/', '2017-05-11 16:03:38'),
(309, '潍坊学院', '山东省', 309, 23.6, 'www.wfu.edu.cn/', '2017-05-11 16:03:38'),
(310, '德州学院', '山东省', 310, 21.5, 'www.dzu.edu.cn/', '2017-05-11 16:03:38');

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE `user` (
  `uid` int(11) NOT NULL,
  `account` varchar(50) DEFAULT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(50) NOT NULL,
  `avatar` varchar(32) NOT NULL,
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`uid`, `account`, `username`, `password`, `avatar`, `date`) VALUES
(1, '511533552@qq.com', 'Adam', 'dfb1e4fc9b64a5e196a8dc4c3ec1e691', '/images/avatar.jpg', '2017-03-31 14:54:33'),
(2, '13699003777', '达云兮', 'dfb1e4fc9b64a5e196a8dc4c3ec1e691', '/images/avatar.jpg', '2017-03-31 15:37:17'),
(3, '511533552', '亚当', 'dfb1e4fc9b64a5e196a8dc4c3ec1e691', '/images/常守朱.jpg', '2017-03-31 15:44:19'),
(4, 'yt511533552', '夏娃', 'dfb1e4fc9b64a5e196a8dc4c3ec1e691', 'images/常守朱.jpg', '2017-03-31 15:54:35');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `forum_posts`
--
ALTER TABLE `forum_posts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `last_comment_time` (`last_comment_time`);

--
-- Indexes for table `post_comment`
--
ALTER TABLE `post_comment`
  ADD PRIMARY KEY (`id`),
  ADD KEY `post_id` (`post_id`),
  ADD KEY `date` (`date`);

--
-- Indexes for table `universities`
--
ALTER TABLE `universities`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`uid`),
  ADD UNIQUE KEY `account` (`account`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `forum_posts`
--
ALTER TABLE `forum_posts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
--
-- 使用表AUTO_INCREMENT `post_comment`
--
ALTER TABLE `post_comment`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
--
-- 使用表AUTO_INCREMENT `universities`
--
ALTER TABLE `universities`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=311;
--
-- 使用表AUTO_INCREMENT `user`
--
ALTER TABLE `user`
  MODIFY `uid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;
--
-- 限制导出的表
--

--
-- 限制表 `post_comment`
--
ALTER TABLE `post_comment`
  ADD CONSTRAINT `post_comment_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `forum_posts` (`id`) ON DELETE CASCADE;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
